Polish public engineering documentation
